; domain
;; ==========================================================================
;; Domain: Interplanetary Museum Vault (IMV) - Problem 2
;;
;; Extension of Problem 1:
;;  - multiple agent with different capabilities (robotic curator + drone)
;;  - maximum carrying capacity per agent, modelled as a fixed number of
;;     slot objects per robot (kept in plain STRIPS, no numeric
;;     fluents so the domain stays solvable by the same planners as Problem 1)
;; ==========================================================================

(define (domain imv-transport-multi)

  (:requirements :strips :typing :negative-preconditions)

  (:types
    item
    artifact pod - item
    robot location slot
  )

  (:predicates
    (at ?x - item ?l - location)               ; item x (artifact or pod) is at location l
    (robot-at ?r - robot ?l - location)         ; robot r is at location l

    (slot-of ?s - slot ?r - robot)               ; slot s belongs to robot r
    (slot-free ?s - slot)                        ; slot s empty
    (holding ?s - slot ?x - item)                ; slot s holding item x

    (in-pod ?a - artifact ?p - pod)              ; artifact a is secured inside pod p

    (tunnel-connected ?l1 - location ?l2 - location)      ; room <-> maintenance tunnel passage (ground for robot curator)
    (tunnel-beta-connected ?l1 - location ?l2 - location) ; Hall beta (seismic) <-> maintenance tunnel passage (ground for robot curator)
    (is-hall-beta ?l - location)                 ; marks Hall beta for drone flight preconditions

    (sealed ?r - robot)                          ; robot r has sealing mode active (ground robot curator travel only)
    (seismic-active)                             ; a seismic event is currently active

    (can-fly ?r - robot)                         ; robot r is a drone (bypasses the tunnel)
    (can-carry-pod ?r - robot)                   ; robot r is able to carry an anti-vibration pod (only robot curator, not the drone)

    (is-fragile ?a - artifact)                   ; artifact a must be secured in a pod before being moved
    (is-alpha ?a - artifact)                     ; artifact a must be cooled and delivered to the cryo chamber
    (is-core-sample ?a - artifact)                ; artifact a is a martian core sample

    (stabilized ?a - artifact)                   ; artifact a has been secured in a pod
    (cooled ?a - artifact)                   ; artifact a has been cooled
  )

  ;; ---- movement. All rooms are reachable with the maintenance tunnel at the center of the map ------

  (:action move-via-tunnel
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (robot-at ?r ?from) (tunnel-connected ?from ?to) (sealed ?r))
    :effect (and (robot-at ?r ?to) (not (robot-at ?r ?from)))
  )

  (:action move-via-tunnel-to-beta
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (robot-at ?r ?from) (tunnel-beta-connected ?from ?to)
                        (sealed ?r) (not (seismic-active)))
    :effect (and (robot-at ?r ?to) (not (robot-at ?r ?from)))
  )

;; ---- sealing mode for maintenance tunnel crossing of robot curator ---------------------
  (:action activate-sealing
    :parameters (?r - robot)
    :precondition (not (sealed ?r))
    :effect (sealed ?r)
  )

  (:action deactivate-sealing
    :parameters (?r - robot)
    :precondition (sealed ?r)
    :effect (not (sealed ?r))
  )

  ;; ---- aerial movement for drone. No tunnel sealing needed -----

  (:action fly
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (robot-at ?r ?from) (can-fly ?r)
                        (not (is-hall-beta ?from)) (not (is-hall-beta ?to)))
    :effect (and (robot-at ?r ?to) (not (robot-at ?r ?from)))
  )

  (:action fly-to-beta
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (robot-at ?r ?from) (can-fly ?r)
                        (is-hall-beta ?to) (not (seismic-active)))
    :effect (and (robot-at ?r ?to) (not (robot-at ?r ?from)))
  )

  (:action fly-from-beta
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (robot-at ?r ?from) (can-fly ?r)
                        (is-hall-beta ?from) (not (seismic-active)))
    :effect (and (robot-at ?r ?to) (not (robot-at ?r ?from)))
  )

  ;; ---- handling pods. Robot curator only, requires can-carry-pod ----------------

  (:action pickup-pod
    :parameters (?r - robot ?p - pod ?l - location ?s - slot)
    :precondition (and (robot-at ?r ?l) (at ?p ?l) (can-carry-pod ?r)
                        (slot-of ?s ?r) (slot-free ?s))
    :effect (and (holding ?s ?p) (not (at ?p ?l)) (not (slot-free ?s)))
  )

  (:action putdown-pod
    :parameters (?r - robot ?p - pod ?l - location ?s - slot)
    :precondition (and (robot-at ?r ?l) (slot-of ?s ?r) (holding ?s ?p))
    :effect (and (at ?p ?l) (slot-free ?s) (not (holding ?s ?p)))
  )

  ;; ---- handling non-fragile artifacts directly -----------------------------

  (:action pickup-artifact
    :parameters (?r - robot ?a - artifact ?l - location ?s - slot)
    :precondition (and (robot-at ?r ?l) (at ?a ?l) (not (is-fragile ?a))
                        (slot-of ?s ?r) (slot-free ?s))
    :effect (and (holding ?s ?a) (not (at ?a ?l)) (not (slot-free ?s)))
  )

  (:action putdown-artifact
    :parameters (?r - robot ?a - artifact ?l - location ?s - slot)
    :precondition (and (robot-at ?r ?l) (slot-of ?s ?r) (holding ?s ?a))
    :effect (and (at ?a ?l) (slot-free ?s) (not (holding ?s ?a)))
  )

  ;; ---- handling fragile artifacts (must go inside a pod) ------
  ;; The robot has to be carrying a pod, travel to the artifact and load it in pod.

  (:action secure-in-pod
    :parameters (?r - robot ?a - artifact ?p - pod ?l - location ?s - slot)
    :precondition (and (robot-at ?r ?l) (slot-of ?s ?r) (holding ?s ?p)
                        (at ?a ?l) (is-fragile ?a))
    :effect (and (in-pod ?a ?p) (stabilized ?a) (not (at ?a ?l)))
  )

  (:action unload-from-pod
    :parameters (?r - robot ?a - artifact ?p - pod ?l - location ?s - slot)
    :precondition (and (robot-at ?r ?l) (slot-of ?s ?r) (holding ?s ?p) (in-pod ?a ?p))
    :effect (and (at ?a ?l) (not (in-pod ?a ?p)))
  )

  ;; ---- handling alpha artifacts (must be cooled down) ------

  (:action cool
    :parameters (?r - robot ?a - artifact ?s - slot)
    :precondition (and (slot-of ?s ?r) (holding ?s ?a) (is-alpha ?a) (not (cooled ?a)))
    :effect (cooled ?a)
  )

 ;; ---- handling fragile alpha artifacts (must be cooled down + put inside a pod) ------
  (:action cool-in-pod
    :parameters (?r - robot ?a - artifact ?p - pod ?s - slot)
    :precondition (and (slot-of ?s ?r) (holding ?s ?p) (in-pod ?a ?p)
                        (is-alpha ?a) (not (cooled ?a)))
    :effect (cooled ?a)
  )
)

; problem
(define (problem imv-transport-p2)
  (:domain imv-transport-multi)

  (:objects
    curator1 - robot
    drone1 - robot
    slot-c1a slot-c1b - slot   ; curator1 has capacity 2
    slot-d1a - slot            ; drone1 has capacity 1
    pod1 pod2 - pod
    art-beta-1                - artifact  ; common item (not fragile) from Hall beta
    art-beta-2                - artifact  ; fragile item from Hall beta
    art-alpha-1               - artifact  ; alpha item, not fragile
    art-alpha-2                - artifact  ; alpha item + fragile
    core-sample-1              - artifact  ; Martian Core Sample
    entrance tunnel anti-vibration-pods hall-alpha hall-beta cryo-chamber stasis-lab - location
  )

  (:init
    ;; robots
    (robot-at curator1 entrance)
    (robot-at drone1 entrance)

    ;; robot slots
    (slot-of slot-c1a curator1)
    (slot-of slot-c1b curator1)
    (slot-free slot-c1a)
    (slot-free slot-c1b)

    ;; drone slots
    (slot-of slot-d1a drone1)
    (slot-free slot-d1a)

    ;; curators' capabilities
    (can-carry-pod curator1)   ; only the robot curator can handle pods
    (can-fly drone1)           ; only the drone bypasses the tunnel

    ;; pods start stored in the Anti-Vibration Pods room
    (at pod1 anti-vibration-pods)
    (at pod2 anti-vibration-pods)

    ;; artifacts' initial locations
    (at art-beta-1 hall-beta)
    (at art-beta-2 hall-beta)
    (at art-alpha-1 hall-alpha)
    (at art-alpha-2 hall-alpha)
    (at core-sample-1 cryo-chamber)

    ;; artifact characteristics
    (is-fragile art-beta-2)
    (is-alpha art-alpha-1)
    (is-alpha art-alpha-2)
    (is-fragile art-alpha-2)
    (is-core-sample core-sample-1)

    ;; map topology: every room hangs off the Maintenance Tunnel (ground travel)
    (tunnel-connected entrance tunnel)
    (tunnel-connected tunnel entrance)
    (tunnel-connected anti-vibration-pods tunnel)
    (tunnel-connected tunnel anti-vibration-pods)
    (tunnel-connected hall-alpha tunnel)
    (tunnel-connected tunnel hall-alpha)
    (tunnel-connected cryo-chamber tunnel)
    (tunnel-connected tunnel cryo-chamber)
    (tunnel-connected stasis-lab tunnel)
    (tunnel-connected tunnel stasis-lab)

    (tunnel-beta-connected hall-beta tunnel)
    (tunnel-beta-connected tunnel hall-beta)

    ;; drone flight only needs to know which room is the seismic sensitive one
    (is-hall-beta hall-beta)

    ;; map properties: 
    ;;(seismic-active) deliberately absent
  )

  (:goal
    ;; as in Problem 1
    (and
      (at art-beta-1 stasis-lab)
      (stabilized art-beta-2) (at art-beta-2 stasis-lab)
      (cooled art-alpha-1) (at art-alpha-1 cryo-chamber)
      (stabilized art-alpha-2) (cooled art-alpha-2) (at art-alpha-2 cryo-chamber)
      (at core-sample-1 stasis-lab)
    )
  )
)

; plan
1. (activate-sealing curator1)
   added: (sealed curator1)
   goals met: 0 of 9
2. (move-via-tunnel curator1 entrance tunnel)
   deleted: (robot-at curator1 entrance)
   added: (robot-at curator1 tunnel)
   goals met: 0 of 9
3. (move-via-tunnel curator1 tunnel anti-vibration-pods)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 anti-vibration-pods)
   goals met: 0 of 9
4. (pickup-pod curator1 pod1 anti-vibration-pods slot-c1a)
   deleted: (at pod1 anti-vibration-pods) (slot-free slot-c1a)
   added: (holding slot-c1a pod1)
   goals met: 0 of 9
5. (move-via-tunnel curator1 anti-vibration-pods tunnel)
   deleted: (robot-at curator1 anti-vibration-pods)
   added: (robot-at curator1 tunnel)
   goals met: 0 of 9
6. (move-via-tunnel-to-beta curator1 tunnel hall-beta)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 hall-beta)
   goals met: 0 of 9
7. (secure-in-pod curator1 art-beta-2 pod1 hall-beta slot-c1a)
   deleted: (at art-beta-2 hall-beta)
   added: (in-pod art-beta-2 pod1) (stabilized art-beta-2)
   goals met: 1 of 9
8. (pickup-artifact curator1 art-beta-1 hall-beta slot-c1b)
   deleted: (at art-beta-1 hall-beta) (slot-free slot-c1b)
   added: (holding slot-c1b art-beta-1)
   goals met: 1 of 9
9. (move-via-tunnel-to-beta curator1 hall-beta tunnel)
   deleted: (robot-at curator1 hall-beta)
   added: (robot-at curator1 tunnel)
   goals met: 1 of 9
10. (move-via-tunnel curator1 tunnel stasis-lab)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 stasis-lab)
   goals met: 1 of 9
11. (unload-from-pod curator1 art-beta-2 pod1 stasis-lab slot-c1a)
   deleted: (in-pod art-beta-2 pod1)
   added: (at art-beta-2 stasis-lab)
   goals met: 2 of 9
12. (putdown-artifact curator1 art-beta-1 stasis-lab slot-c1b)
   deleted: (holding slot-c1b art-beta-1)
   added: (at art-beta-1 stasis-lab) (slot-free slot-c1b)
   goals met: 3 of 9
13. (move-via-tunnel curator1 stasis-lab tunnel)
   deleted: (robot-at curator1 stasis-lab)
   added: (robot-at curator1 tunnel)
   goals met: 3 of 9
14. (move-via-tunnel curator1 tunnel hall-alpha)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 hall-alpha)
   goals met: 3 of 9
15. (secure-in-pod curator1 art-alpha-2 pod1 hall-alpha slot-c1a)
   deleted: (at art-alpha-2 hall-alpha)
   added: (in-pod art-alpha-2 pod1) (stabilized art-alpha-2)
   goals met: 4 of 9
16. (pickup-artifact curator1 art-alpha-1 hall-alpha slot-c1b)
   deleted: (at art-alpha-1 hall-alpha) (slot-free slot-c1b)
   added: (holding slot-c1b art-alpha-1)
   goals met: 4 of 9
17. (move-via-tunnel curator1 hall-alpha tunnel)
   deleted: (robot-at curator1 hall-alpha)
   added: (robot-at curator1 tunnel)
   goals met: 4 of 9
18. (move-via-tunnel curator1 tunnel cryo-chamber)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 cryo-chamber)
   goals met: 4 of 9
19. (cool-in-pod curator1 art-alpha-2 pod1 slot-c1a)
   added: (cooled art-alpha-2)
   goals met: 5 of 9
20. (unload-from-pod curator1 art-alpha-2 pod1 cryo-chamber slot-c1a)
   deleted: (in-pod art-alpha-2 pod1)
   added: (at art-alpha-2 cryo-chamber)
   goals met: 6 of 9
21. (cool curator1 art-alpha-1 slot-c1b)
   added: (cooled art-alpha-1)
   goals met: 7 of 9
22. (fly drone1 entrance cryo-chamber)
   deleted: (robot-at drone1 entrance)
   added: (robot-at drone1 cryo-chamber)
   goals met: 7 of 9
23. (pickup-artifact drone1 core-sample-1 cryo-chamber slot-d1a)
   deleted: (at core-sample-1 cryo-chamber) (slot-free slot-d1a)
   added: (holding slot-d1a core-sample-1)
   goals met: 7 of 9
24. (fly drone1 cryo-chamber stasis-lab)
   deleted: (robot-at drone1 cryo-chamber)
   added: (robot-at drone1 stasis-lab)
   goals met: 7 of 9
25. (putdown-artifact drone1 core-sample-1 stasis-lab slot-d1a)
   deleted: (holding slot-d1a core-sample-1)
   added: (at core-sample-1 stasis-lab) (slot-free slot-d1a)
   goals met: 8 of 9
26. (putdown-artifact curator1 art-alpha-1 cryo-chamber slot-c1b)
   deleted: (holding slot-c1b art-alpha-1)
   added: (at art-alpha-1 cryo-chamber) (slot-free slot-c1b)
   goals met: 9 of 9
